Revit 2027 API
MaterialNode.Color Property
 The color the material is being rendered at
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color Color { get; }
Public ReadOnly Property Color As Color
	Get
public:
property Color^ Color {
	Color^ get ();
}
member Color : Color with get
Property Value
Color
Remarks
 The value may differ from the default color property of the material, because it might have been overridden by rendering settings.
See Also
Reference
MaterialNode Class
Autodesk.Revit.DB Namespace